data/PH_Breuer/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0400330813441108 1.00195548402186 -4.50814446765757e-18)
(0.12008860673469 1.00097057324871 4.79601003082834e-18)
(0.199839191692114 0.994974861300155 0)
(0.278076555890878 0.979069405354692 0)
(0.352740610007525 0.950971083730314 0)
(0.422714026072904 0.912370272400837 0)
(0.488707852010148 0.867147087547933 -2.56805427562162e-18)
(0.551974332781044 0.818142738010672 4.95914982900486e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0400380444494785 1 0)
(0.12009112920742 0.999013462385996 0)
(0.199800917836694 0.993013560517572 0)
(0.277973123732253 0.977106876033293 0)
(0.352564097866706 0.949013650492265 0)
(0.422486414070752 0.91039554727693 0)
(0.488446790561577 0.865122145123153 0)
(0.551688813173322 0.81604113176491 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0375 3.035 0)
(0.1125 3.035 0)
(0.1875 3.035 0)
(0.2625 3.035 0)
(0.3375 3.035 0)
(0.4125 3.035 0)
(0.4875 3.035 0)
(0.5625 3.035 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
